Core/src/Documents/УстановкаСкидок/УстановкаСкидок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаСкидок</name>
  <registerRecords>AccountingRegister.AzRyХозрасчетныйUSD</registerRecords>
  <registerRecords>InformationRegister.СкидкиПоНоменклатурнымГруппам</registerRecords>
  <registerRecords>InformationRegister.СкидкиПоНоменклатурам</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>КонецДействия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Запасы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ФиксированнаяЦена</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>13</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпособОкругления</name>
      <type>
        <types>EnumRef.СпособыОкругления</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ГруппыНоменклатур</name>
    <attributes>
      <name>ГруппаНоменклатуры</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ФиксированнаяЦена</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>13</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпособОкругления</name>
      <type>
        <types>EnumRef.СпособыОкругления</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/Enums/СпособыОкругления/СпособыОкругления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыОкругления</name>
  <enumValues>
    <name>Вниз</name>
  </enumValues>
  <enumValues>
    <name>Вверх</name>
  </enumValues>
</mdclass:Enum>

Core/src/Enums/ТипыНоменклатуры/ТипыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНоменклатуры</name>
  <enumValues>
    <name>Запас</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
  <enumValues>
    <name>Работа</name>
  </enumValues>
  <enumValues>
    <name>Операция</name>
  </enumValues>
  <enumValues>
    <name>ВидРабот</name>
  </enumValues>
  <enumValues>
    <name>AzRyРасход</name>
  </enumValues>
</mdclass:Enum>

Core/src/Documents/УстановкаСкидок/ManagerModule.bsl
#Область ЗагрузкаДанныхИзВнешнегоИсточника

Процедура ПоляЗагрузкиДанныхИзВнешнегоИсточника(ТаблицаПолейЗагрузки, НастройкиЗагрузкиДанных) Экспорт
	
	//
	// Для группы полей действует правило: хотя бы одно поле в группе должно быть выбрано в колонках
	//
	
	ОписаниеТиповСтрока25 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(25));
	ОписаниеТиповСтрока30 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(30));
	ОписаниеТиповСтрока50 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(50));
	ОписаниеТиповСтрока100 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(100));
	ОписаниеТиповСтрока150 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(150));
	ОписаниеТиповСтрока200 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(200));
	ОписаниеТиповСтрока1000 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(1000));
	ОписаниеТиповЧисло15_2 = Новый ОписаниеТипов("Число", , , , Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Неотрицательный));
	ОписаниеТиповЧисло15_3 = Новый ОписаниеТипов("Число", , , , Новый КвалификаторыЧисла(15, 3, ДопустимыйЗнак.Неотрицательный));
	ОписаниеТиповЧисло4_2 = Новый ОписаниеТипов("Число", , , , Новый КвалификаторыЧисла(4, 2, ДопустимыйЗнак.Неотрицательный));

	ОписаниеТиповДата = Новый ОписаниеТипов("Дата", , , , Новый КвалификаторыДаты(ЧастиДаты.Дата));
	
	ОписаниеТиповКолонка = Новый ОписаниеТипов("СправочникСсылка.Номенклатура");
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Штрихкод", НСтр("en='Barcode';ka='შტრიხ კოდი';ru='Штрихкод'"), ОписаниеТиповСтрока200, ОписаниеТиповКолонка, "Номенклатура", 1, , Истина);
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Артикул", НСтр("en='OptionCode';ka='არტიკული';ru='Артикул'"), ОписаниеТиповСтрока25, ОписаниеТиповКолонка, "Номенклатура", 2, , Истина);
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "НоменклатураНаименование", НСтр("ka='ნომენკლატურა (დასახელება)';ru='Номенклатура (наименование)';en='Nomenclature (name)'"), ОписаниеТиповСтрока100, ОписаниеТиповКолонка, "Номенклатура", 3, , Истина);
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "НоменклатураНаименованиеПолное",НСтр("ka='ნომენკლატურა (სრული დასახელება)';ru='Номенклатура (полное наименование';en='Nomenclature (full name'"), ОписаниеТиповСтрока1000, ОписаниеТиповКолонка, "Номенклатура", 5, , Истина);
	
	//ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Содержание",  НСтр("en='Content';ka='შინაარსი';ru='Содержание'"), ОписаниеТиповСтрока1000, ОписаниеТиповСтрока1000, , , , , НастройкиЗагрузкиДанных.СодержаниеВидимо);
	
	
	//НСтр("ru='';ka=''");
	//Если ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристики") Тогда
	//	
	//	ОписаниеТиповКолонка = Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры");
	//	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Характеристика",  НСтр("ru = 'Характеристика (наименование)'; ka = 'მახასიათებელი  (დასახელება)'; en = 'Characteristics (name)'"), ОписаниеТиповСтрока150, ОписаниеТиповКолонка);
	//	
	//КонецЕсли;
	
	//Если ПолучитьФункциональнуюОпцию("ИспользоватьПартии") Тогда
	//	
	//	ОписаниеТиповКолонка = Новый ОписаниеТипов("СправочникСсылка.ПартииНоменклатуры");

	//	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Партия", НСтр("ka='პარტია (დასახელება)';ru='Партия (наименование)';en='Party (name)'"), ОписаниеТиповСтрока100, ОписаниеТиповКолонка);
	//	
	//КонецЕсли;
	//
	ОписаниеБулева = Новый ОписаниеТипов("Булево");
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "ФиксированнаяЦена", НСтр("ru = 'Фиксированная Цена'; ka = 'ფიქსირებული ფასი'"), ОписаниеТиповСтрока100, ОписаниеБулева);

	
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Цена",  НСтр("en='Quantity';ka='ფასი';ru='Цена'"), ОписаниеТиповСтрока25, ОписаниеТиповЧисло15_3, , , Ложь);
	
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "ПроцентСкидки",  НСтр("ru = '% Скидки'; ka = 'ფასადაკლების %'"), ОписаниеТиповСтрока25, ОписаниеТиповЧисло4_2, , , Ложь);
	

	ОписаниеСпособОкругления = Новый ОписаниеТипов("ПеречислениеСсылка.СпособыОкругления");
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "СпособОкругления", НСтр("ru = 'способ округления'; ka = 'დამრგვალების წესი'"), ОписаниеТиповСтрока100, ОписаниеСпособОкругления);
	
	//ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Резерв", НСтр("ka='რეზერვი';ru='Резерв';en='Резерв'"), ОписаниеТиповСтрока25, ОписаниеТиповЧисло15_3, , , , , ПолучитьФункциональнуюОпцию("РезервированиеЗапасов"));
	
	//ОписаниеТиповКолонка = Новый ОписаниеТипов("СправочникСсылка.КлассификаторЕдиницИзмерения, СправочникСсылка.ЕдиницыИзмерения");
	//ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "ЕдиницаИзмерения", НСтр("en='Unit Measurement';ka='საზომი ერთეული';ru='Ед. изм.'"), ОписаниеТиповСтрока25, ОписаниеТиповКолонка, , , , , ПолучитьФункциональнуюОпцию("УчетВРазличныхЕдиницахИзмерения"));
	
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Комментарий",  НСтр("ru = '% Комментарий'; ka = 'კომენტარი'"), ОписаниеТиповСтрока25, ОписаниеТиповСтрока1000, , , Ложь);

КонецПроцедуры

Процедура ПриОпределенииОбразцовЗагрузкиДанных(НастройкиЗагрузкиДанных, УникальныйИдентификатор) Экспорт
	
	Образец_xlsx = ПолучитьМакет("ОбразецЗагрузкиДанных_xlsx");
	ОбразецЗагрузкиДанных_xlsx = ПоместитьВоВременноеХранилище(Образец_xlsx, УникальныйИдентификатор);
	НастройкиЗагрузкиДанных.Вставить("ОбразецЗагрузкиДанных_xlsx", ОбразецЗагрузкиДанных_xlsx);
	
	НастройкиЗагрузкиДанных.Вставить("ОбразецЗагрузкиДанных_mxl", "ОбразецЗагрузкиДанных_mxl");
	
	Образец_csv = ПолучитьМакет("ОбразецЗагрузкиДанных_csv");
	ОбразецЗагрузкиДанных_csv = ПоместитьВоВременноеХранилище(Образец_csv, УникальныйИдентификатор);
	НастройкиЗагрузкиДанных.Вставить("ОбразецЗагрузкиДанных_csv", ОбразецЗагрузкиДанных_csv);
	
КонецПроцедуры

Процедура СопоставитьЗагружаемыеДанныеИзВнешнегоИсточника(ТаблицаСопоставленияДанных, НастройкиЗагрузкиДанных) Экспорт
	
	ПолноеИмяОбъектаЗаполнения = НастройкиЗагрузкиДанных.ПолноеИмяОбъектаЗаполнения;
	
	// ТаблицаСопоставленияДанных - Тип ДанныеФормыКоллекция
	Для каждого СтрокаТаблицыФормы Из ТаблицаСопоставленияДанных Цикл
		
		// Номенклатура по ШтрихКоду, Артикулу, Наименованию, НаименованиеПолное
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьНоменклатуру(СтрокаТаблицыФормы.Номенклатура,СтрокаТаблицыФормы.Штрихкод,СтрокаТаблицыФормы.Артикул, СтрокаТаблицыФормы.НоменклатураНаименование, СтрокаТаблицыФормы.НоменклатураНаименованиеПолное);
		
		// Комментарий
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СкопироватьСтрокуВЗначениеСтроковогоТипа(СтрокаТаблицыФормы.Комментарий, СтрокаТаблицыФормы.Комментарий_ВходящиеДанные);
		
		//// Характеристика по Владельцу и Наименованию
		//Если ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристики") Тогда
		//	
		//	Если ЗначениеЗаполнено(СтрокаТаблицыФормы.Номенклатура) Тогда
		//		
		//		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьХарактеристику(СтрокаТаблицыФормы.Характеристика, СтрокаТаблицыФормы.Номенклатура, СтрокаТаблицыФормы.Штрихкод, СтрокаТаблицыФормы.Характеристика_ВходящиеДанные);
		//		
		//	КонецЕсли;
		//	
		//КонецЕсли;
		
		//// Партия по Владельцу и Наименованию
		//Если ПолучитьФункциональнуюОпцию("ИспользоватьПартии") Тогда
		//	
		//	Если ЗначениеЗаполнено(СтрокаТаблицыФормы.Номенклатура) Тогда
		//		
		//		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьПартию(СтрокаТаблицыФормы.Партия, СтрокаТаблицыФормы.Номенклатура, СтрокаТаблицыФормы.Штрихкод, СтрокаТаблицыФормы.Партия_ВходящиеДанные);
		//		
		//	КонецЕсли;
		//	
		//КонецЕсли;
				
		//ФиксированнаяЦена
		Если не ПустаяСтрока(СтрокаТаблицыФормы.ФиксированнаяЦена_ВходящиеДанные) Тогда 
			Если  СтрокаТаблицыФормы.ФиксированнаяЦена_ВходящиеДанные = "დიახ" или 
				СтрокаТаблицыФормы.ФиксированнаяЦена_ВходящиеДанные = "Да" Тогда 
				СтрокаТаблицыФормы.ФиксированнаяЦена = Истина
			ИначеЕсли 	
				СтрокаТаблицыФормы.ФиксированнаяЦена_ВходящиеДанные = "არა" или 
				СтрокаТаблицыФормы.ФиксированнаяЦена_ВходящиеДанные = "Нет" Тогда
				СтрокаТаблицыФормы.ФиксированнаяЦена = Ложь	
			КонецЕсли;	 		
		КонецЕсли;
		
		
		Если не СтрокаТаблицыФормы.ФиксированнаяЦена Тогда 
			// ПроцентСкидки
			ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВЧисло(СтрокаТаблицыФормы.ПроцентСкидки, СтрокаТаблицыФормы.ПроцентСкидки_ВходящиеДанные, 0);
			
			//СпособОкругления
			Если не ПустаяСтрока(СтрокаТаблицыФормы.СпособОкругления_ВходящиеДанные) Тогда 
				Если  СтрокаТаблицыФормы.СпособОкругления_ВходящиеДанные = "მეტობით" или 
					СтрокаТаблицыФормы.СпособОкругления_ВходящиеДанные = "Вверх" Тогда 
					СтрокаТаблицыФормы.СпособОкругления = ПредопределенноеЗначение("Перечисление.СпособыОкругления.Вверх")
				ИначеЕсли 	
					СтрокаТаблицыФормы.СпособОкругления_ВходящиеДанные = "ნაკლებობით" или 
					СтрокаТаблицыФормы.СпособОкругления_ВходящиеДанные = "Вниз" Тогда
					СтрокаТаблицыФормы.СпособОкругления = ПредопределенноеЗначение("Перечисление.СпособыОкругления.Вниз")		
				КонецЕсли;	 		
			КонецЕсли;	
		Иначе 		
			// Цена
			ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВЧисло(СтрокаТаблицыФормы.Цена, СтрокаТаблицыФормы.Цена_ВходящиеДанные, 0);
		КонецЕсли;
		
		
		//// Резерв
		//Если ПолучитьФункциональнуюОпцию("РезервированиеЗапасов") Тогда
		//	
		//	ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВЧисло(СтрокаТаблицыФормы.Резерв, СтрокаТаблицыФормы.Резерв_ВходящиеДанные, 0);
		//	
		//КонецЕсли;
		
		//// ЕдиницыИзмерения по Наименованию (так же рассмотреть возможность прикрутить пользовательские ЕИ)
		//ЗначениеПоУмолчанию = ?(ЗначениеЗаполнено(СтрокаТаблицыФормы.Номенклатура), СтрокаТаблицыФормы.Номенклатура.ЕдиницаИзмерения, Справочники.КлассификаторЕдиницИзмерения.шт);
		//ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьЕдиницыИзмерения(СтрокаТаблицыФормы.Номенклатура, СтрокаТаблицыФормы.ЕдиницаИзмерения, СтрокаТаблицыФормы.ЕдиницаИзмерения_ВходящиеДанные, ЗначениеПоУмолчанию);
		
		//// Цена
		//ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВЧисло(СтрокаТаблицыФормы.Цена, СтрокаТаблицыФормы.Цена_ВходящиеДанные, 0);
		//
		//// СтавкаНДС по наименованию
		//ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьСтавкуНДС(СтрокаТаблицыФормы.СтавкаНДС, СтрокаТаблицыФормы.СтавкаНДС_ВходящиеДанные, Неопределено);
		//
		//// СуммаНДС
		//ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВЧисло(СтрокаТаблицыФормы.СуммаНДС, СтрокаТаблицыФормы.СуммаНДС_ВходящиеДанные, 0);
		//
		//// Заказ
		//ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьЗаказ(СтрокаТаблицыФормы.Заказ, СтрокаТаблицыФормы.Заказ_ВходящиеДанные);
		
		// Страна и ГТД
		//Если ПолучитьФункциональнуюОпцию("УчетГТД") Тогда
		//	
		//	ЗначениеПоУмолчанию = Неопределено;
		//	Если ЗначениеЗаполнено(СтрокаТаблицыФормы.Номенклатура) Тогда
		//		
		//		ЗначениеПоУмолчанию = СтрокаТаблицыФормы.Номенклатура.СтранаПроисхождения;
		//		
		//	КонецЕсли;
			
			//ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьСтрануПроисхождения(,, );
			//
			//Если ЗначениеЗаполнено(СтрокаТаблицыФормы.СтранаПроисхождения)
			//	И СтрокаТаблицыФормы.СтранаПроисхождения <> Справочники.СтраныМира.Россия Тогда
			//	
			//	ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьНомерГТД(СтрокаТаблицыФормы.НомерГТД, СтрокаТаблицыФормы.НомерГТД_ВходящиеДанные);
			//	
			//КонецЕсли;
			
		//КонецЕсли;
		
		ПроверитьКорректностьДанныхВСтрокеТаблицы(СтрокаТаблицыФормы);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьКорректностьДанныхВСтрокеТаблицы(СтрокаТаблицыФормы, ПолноеИмяОбъектаЗаполнения = "") Экспорт
	
	ИмяСлужебногоПоля = ЗагрузкаДанныхИзВнешнегоИсточника.ИмяСлужебногоПоляЗагрузкаВПриложениеВозможна();
	
	СтрокаТаблицыФормы[ИмяСлужебногоПоля] = ЗначениеЗаполнено(СтрокаТаблицыФормы.Номенклатура)
		И (СтрокаТаблицыФормы.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Запас ); 
			//ИЛИ СтрокаТаблицыФормы.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга)
		//И СтрокаТаблицыФормы.Количество <> 0);
	
КонецПроцедуры

#КонецОбласти
